/* eslint-disable max-len */
import React from 'react';
import './index.less';

function Agreement() {
  return (
    <div className="agreement-wrap">
      <h2>服务协议</h2>
      <div className="desc-wrap">
        <p>一.您在使用我方提供的“系统”过程当中，您须自行承担使用本“系统”的风险。基于每个硬件设备差异、数据被覆盖损坏等原因，使用本软件并不能100%恢复成功。</p>
        <p>二.在任何情况下，对于因使用或无法使用本“系统”而导致的任何损失（包括但不仅限于商业利润损失、业务中断或信息丢失、非法使用遭受的处罚），我方无需向您或任何第三方负责，即使本“系统”未告知可能会造成此类损失。</p>
        <p>三.在任何情况下，本“系统”均不就任何直接的、间接的、附带的、后果性的、特别的、惩戒性的和处罚性的损害赔偿承担任何责任，无论该主张是基于保证、合同、非法使用侵权（包括疏忽）或是基于其他原因作出。</p>
        <p>四.您在使用本“系统”时，不得将本“系统”产品或服务用于任何非法用途或本协议条款、条件和声明禁止的用途。您为系统载体的设备所有者或使用者，任何非法用途（如侵犯他人隐私、泄露他人秘密等）导致的法律责任均由您个人承担，我公司概不承担。</p>
        <p>五.您向我方支付的技术服务费，一旦我方向您提供技术服务，所支付的款项概不退还。</p>
      </div>
    </div>
  );
}

export default Agreement;
